Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60100.PIC
      <edc:AdjustPoint edc:_addr="0x40001830" edc:offset="0x3D0"/>
      <edc:SFRDef edc:_addr="0x40001C00" edc:access="-------n" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001C01" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001C04" edc:access="----------------------rrrrrrrr-r" edc:cname="SYNCBUSY" edc:impl="0x3FD" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL0" edc:desc="Generic Clock Generator Control 0 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL1" edc:desc="Generic Clock Generator Control 1 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL2" edc:desc="Generic Clock Generator Control 2 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL3" edc:desc="Generic Clock Generator Control 3 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL4" edc:desc="Generic Clock Generator Control 4 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL5" edc:desc="Generic Clock Generator Control 5 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL6" edc:desc="Generic Clock Generator Control 6 Synchronization Busy bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GENCTRL7" edc:desc="Generic Clock Generator Control 7 Synchronization Busy bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001C08" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x40001C20" edc:access="nnnnnnnnnnnnnnnn--nnnnnn----nnnn" edc:cname="GENCTRL0" edc:impl="0xFFFF3F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad (GCLK_IO)" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OSC16M" edc:desc="OSC16M oscillator output" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DFLLULP" edc:desc="DFLLULP output" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M output" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL96M" edc:desc="FDPLL96M output" edc:when="(field &amp; 0xF) == 8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Division by GENCTRLn.DIV" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Division by 2^(GENCTRLn.DIV+1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001C24" edc:access="nnnnnnnnnnnnnnnn--nnnnnn----nnnn" edc:cname="GENCTRL1" edc:impl="0xFFFF3F0F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Source Select" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad (GCLK_IO)" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="OSC16M" edc:desc="OSC16M oscillator output" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DFLLULP" edc:desc="DFLLULP output" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M output" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL96M" edc:desc="FDPLL96M output" edc:when="(field &amp; 0xF) == 8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:desc="Generic Clock Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:desc="Improve Duty Cycle" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:desc="Output Off Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:desc="Divide Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Division by GENCTRLn.DIV" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Division by 2^(GENCTRLn.DIV+1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Division Factor" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
