Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60100.PIC
      <edc:AdjustPoint edc:_addr="0x420003E8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x420003F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="User 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="User 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="User 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="User 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="User 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="User 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="User 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="User 7 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="User 8 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="User 9 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="User 10 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="User 11 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="User 12 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="User 13 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="User 14 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="User 15 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="User 16 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="User 17 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="User 18 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="User 19 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="User 20 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="User 21 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="User 22 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:desc="User 23 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:desc="User 24 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:desc="User 25 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:desc="User 26 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:desc="User 27 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:desc="User 28 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:desc="User 29 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:desc="User 30 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:desc="User 31 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420003F4" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER1" edc:impl="0xFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:desc="User 32 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:desc="User 33 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:desc="User 34 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:desc="User 35 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:desc="User 36 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:desc="User 37 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:desc="User 38 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:desc="User 39 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:desc="User 40 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:desc="User 41 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:desc="User 42 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:desc="User 43 to be checked as non-secured " edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER44" edc:desc="User 44 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:desc="User 45 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:desc="User 46 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:desc="User 47 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:desc="User 48 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:desc="User 49 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:desc="User 50 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:desc="User 51 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420003F8" edc:offset="0x1808"/>
      <edc:SFRDef edc:_addr="0x42001C00" edc:access="---nn-nn--nn--nn----nnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0x1B330FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Timer Counter Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Counter in 16-bit mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT8" edc:desc="Counter in 8-bit mode" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Counter in 32-bit mode" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset the counter on next generic clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset the counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset the counter on next generic clock and reset the prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Clock On Demand" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Prescaler: GCLK_TC" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Prescaler: GCLK_TC/2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Prescaler: GCLK_TC/4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Prescaler: GCLK_TC/8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Prescaler: GCLK_TC/16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Prescaler: GCLK_TC/64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Prescaler: GCLK_TC/256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Prescaler: GCLK_TC/1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CAPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COPEN0" edc:desc="Capture On Pin 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COPEN1" edc:desc="Capture On Pin 1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CAPTMODE0" edc:desc="Capture Mode Channel 0" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default capture" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CAPTMODE1" edc:desc="Capture mode Channel 1" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default capture" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C04" edc:access="nnn--nnn" edc:cname="CTRLBCLR" edc:impl="0xE7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot on Counter" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Force a start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force a stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update of double-buffered register" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force a read synchronization of COUNT" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C05" edc:access="nnn--nnn" edc:cname="CTRLBSET" edc:impl="0xE7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot on Counter" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Force a start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force a stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update of double-buffered register" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force a read synchronization of COUNT" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C06" edc:access="--nn---n--nn-nnn" edc:cname="EVCTRL" edc:impl="0x3137" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="EVACT" edc:desc="Event Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Start, restart or retrigger TC on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNT" edc:desc="Count on event" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Start TC on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="STAMP" edc:desc="Time stamp capture" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="PPW" edc:desc="Period catured in CC0, pulse width in CC1" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="PWP" edc:desc="Period catured in CC1, pulse width in CC0" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="PW" edc:desc="Pulse width capture" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV" edc:desc="TC Event Input Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCEI" edc:desc="TC Event Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:desc="Event Output Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MCEO0" edc:desc="MC Event Output Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO1" edc:desc="MC Event Output Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C08" edc:access="--nn--nn" edc:cname="INTENCLR" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="OVF Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="ERR Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="MC Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="MC Interrupt Disable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42001C09" edc:access="--nn--nn" edc:cname="INTENSET" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="OVF Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="ERR Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="MC Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="MC Interrupt Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
