Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/edc/PIC32CM1216LS60100.PIC
      <edc:SFRDef edc:_addr="0xE000EFD0" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR4" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="DES_2" edc:desc="JEP106 continuation code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFE0" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PART_0" edc:desc="Part number bits[7:0]" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFE4" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PART_1" edc:desc="Part number bits[11:8]" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DES_0" edc:desc="JEP106 identification code bits [3:0]" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFE8" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR2" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="DES_1" edc:desc="JEP106 identification code bits[6:4]" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEDEC" edc:desc="JEDEC assignee value is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Component revision" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFEC" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR3" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="CMOD" edc:desc="Customer Modified" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="RevAnd" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFF0" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_0" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFF4" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR1" edc:impl="0xFF" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_1" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLASS" edc:desc="CoreSight component class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFF8" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_2" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFFC" edc:access="------------------------rrrrrrrr" edc:cname="DCIDR3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PRMBL_3" edc:desc="CoreSight component identification preamble" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000F000" edc:offset="0x1F004"/>
      <edc:SFRDef edc:_addr="0xE002E004" edc:access="----------------------------rrrr" edc:cname="ICTR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="ICB_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICB_NS">
            <edc:SFRFieldDef edc:cname="INTLINESNUM" edc:desc="Interrupt line set number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ACTLR" edc:nzwidth="0x20" ltx:memberofperipheral="ICB_NS"/>
      <edc:AdjustPoint edc:_addr="0xE002E00C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE002E010" edc:access="---------------n-------------nnn" edc:cname="CSR" edc:impl="0x10007" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="SysTick enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:desc="Tick interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:desc="Clock source" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:desc="Count flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E014" edc:access="-------n------------------------" edc:cname="RVR" edc:impl="0x1000000" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="RELOAD" edc:desc="Counter reload value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE002E018" edc:access="-------n------------------------" edc:cname="CVR" edc:impl="0x1000000" edc:nzwidth="0x20" ltx:memberofperipheral="SysTick_NS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick_NS">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="CURRENT" edc:desc="Current counter value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
